title: LOLBAS certutil detection
id: 35e377b9-6621-4c2b-b2b5-a73fce9f0236
statuse: test # tested in lab
description: Detects the execution of certutil with either the "decode" or "decodehex" flags to decode base64 or hex encoded files.
reference:
  - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
author: Matze
logsource:
  product: windows
  categort: process_creation
detection:
  selection_img:
    - Image|endswith: '\certutil.exe'
    - OriginalFileName: 'CertUtil.exe'
  selection_cli:
    CommandLine|contains:
      - "-urlcache"
      - "-verifyctl"
      - "-encode"
      - "-decode"
      - "-decodehex"
  condition: selection_*
falsepositives:
  - Unknown
level: medium
